Revit 2026 API

# CategoryGetBuiltInCategory Method

---

Gets the BuiltInCategory value corresponding to the given built-in category identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static BuiltInCategory GetBuiltInCategory(
	ForgeTypeId categoryTypeId
)
```
```vb
Public Shared Function GetBuiltInCategory (
	categoryTypeId As ForgeTypeId
) As BuiltInCategory
```
```cpp
public:
static BuiltInCategory GetBuiltInCategory(
	ForgeTypeId^ categoryTypeId
)
```
```fsharp
static member GetBuiltInCategory :
        categoryTypeId : ForgeTypeId -> BuiltInCategory
```

#### Parameters

categoryTypeId ForgeTypeId
     The built-in category identifier.

#### Return Value

BuiltInCategory The BuiltInCategory value corresponding to the given built-in category identifier.

| Exception | Condition |
| --- | --- |
| ArgumentException | categoryTypeId is not a built-in category identifier. See Category.IsBuiltInCategory(ForgeTypeId) and Category.GetBuiltInCategoryTypeId(BuiltInCategory). |
| ArgumentNullException | A non-optional argument was null |

A ForgeTypeId identifies a built-in category if it corresponds to a valid BuiltInCategory value according to Category.IsBuiltInCategory(ForgeTypeId) and Category.GetBuiltInCategoryTypeId(BuiltInCategory).

#### Reference

Category Class

Autodesk.Revit.DB Namespace